app/controllers/archives_controller.rb

SELECT `archives`.* FROM `archives`
---
  def index
    @archives = Archive.paginate(:page => params[:page], :per_page => 10)

INSERT INTO `archives` (`title`, `created_at`, `updated_at`, `media_file_name`, `media_content_type`, `media_file_size`, `media_updated_at`) VALUES ('Cool lightbulb!', '2017-02-26 00:27:07', '2017-02-26 00:27:07', 'lightbulb.jpg', 'image/jpeg', 104717, '2017-02-26 00:27:07')
---
  def create
    @archive = Archive.new({
      :media => params[:archive]["media"],
      :cover => params[:archive]["cover"],
      :title => params[:archive]["title"],
      :description => params[:archive]["description"],
      :date => params[:archive]["date"],
      :featured => params["featured"]
    })

    # Prevent erroring if year is too large
    if @archive.date.year > 9999
        flash[:danger] = "Year must be between 0 and 9999, inclusive"
        redirect_to new_archive_path
        return
    end

    # The tag list has to be saved in a different manner
    begin
      @archive.tag_list.add(params[:archive]["tag_list"], parse: true)
    rescue
      puts "Invalid tag list!"
      redirect_to new_archive_path
    end

    # Save the archive in the database
    if @archive.save