app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(params[:contact].permit(:first, :last, :email, :inquiry, :comment))
    if @contact.save
---
INSERT INTO "contacts" ("first", "last", "email", "inquiry", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["first", ""], ["last", ""], ["email", "a@b.c"], ["inquiry", "General Inquiries/Comments"], ["comment", ""], ["created_at", 2017-02-23 18:39:32 UTC], ["updated_at", 2017-02-23 18:39:32 UTC]]

  def show
  	@contacts = Contact.find(params[:id])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]